procedure WriteInFile(OutFileAddress : String;Xka:masnk);
{запись входного файла для интегратора}
const
  	str:array [1..36] of string = (
{str[1]:=}'1   РЕЖИМ (1 - прогноз; 2 - улучшение орбиты)',
{str[2]:=}' Начальная эпоха (TT)' ,
{str[3]:=}' 1     Число спутников',

{str[4]:=}'         ПРОГНОЗ' ,
{str[5]:=}'Начальный момент прогноза (TT)' ,
{str[6]:=}'Конечный момент прогноза (TT) ' ,
{str[7]:=}'Шаг выдачи (сек)' ,
{str[8]:=}'1E-3   Ошибка большой полуоси (км)' ,

{str[9]:=}'УЛУЧШЕНИЕ' ,
{str[10]:=}'obsvyb.in  Файл с наблюдениями',
{str[11]:=}'5           Число наблюдений',
{str[12]:=}'2822.172315  2201.434565  5279.171158  координаты обсерватории (км)',
{str[13]:=}'0.10         Точность улучшения (сходимости) (км)',
{str[14]:=}'1E-5 1E-8    Вариации начальных координат и скоростей (км и км/c)',
{str[15]:=}'0.1        Множитель, улучшающий сходимость',
{str[16]:=}'2            Начальные условия (1 - из файла; 2 - вычисляются в программе)',
{str[17]:=}'8000        Приблизительный радиус-вектор (км) на момент 1-го наблюдения',

{str[18]:=}'ИНТЕГРИРОВАНИЕ',
{str[19]:=}'   10.  Постоянный шаг интегрирования (сек; для отриц. параметра)',
{str[20]:=}'   19   Порядок интегратора (от 7 до 39 через 4)',
{str[21]:=}'   10   Параметр интегратора',
{str[22]:=}' 1000   Интервал промежуточных выдач на экран (в шагах интегрирования)',

{str[23]:=}'ВОЗМУЩЕНИЯ',
{str[24]:=}' 12  12   Гармоники геопотенциала (NM)',
{str[25]:=}'    1   Луна',
{str[26]:=}'    1   Солнце',
{str[27]:=}'    1   Световое давление и ПР эффект',
{str[28]:=}'0 0 0   Релятивистские эффекты (Ф_0, Ф_1, Ф_2)',
{str[29]:=}'    1   Приливы',
{str[30]:=}'    0   Атмосфера',
{str[31]:=}'  100.  Высота сгорания (км)',

{str[32]:=}'СПУТНИК',
{str[33]:=}'  500.   Масса (кг)',
{str[34]:=}'  0.5   Площадь миделева сечения (м^2)',
{str[35]:=}'   2.   Коэф-т лобового сопротивления',
{str[36]:=}'   2.   Коэф-т отражения');
{_________________________________________________________________________}

var
  InFile, OutFile 		   : Text;
  i,j	                 	   : integer;
begin {pr2}
assign(outf,OutFileAddress);
rewrite(outf);

writeln(outf,str[1]);
writeln(outf,year1,'  ',month1,'  ',day1,'  ',hour1,'  ',min1,'  ',sec1:2:3,'  ',str[2]);
writeln(outf,str[3]);
writeln(outf,' ',xka[1],'  ',xka[2],'  ',xka[3]);
writeln(outf,' ',xka[4],'  ',xka[5],'  ',xka[6]);
writeln(outf);

writeln(outf,str[4]);
writeln(outf,year1,'  ',month1,'  ',day1,'  ',hour1,'  ',min1,'  ',sec1:2:3,'  ',str[5]);
writeln(outf,year2,'  ',month2,'  ',day2,'  ',hour2,'  ',min2,'  ',sec2:2:3,'  ',str[6]);
writeln(outf,step,' ',str[7]);
writeln(outf,str[8]);
writeln(outf);

for i:=9 to 17 do
  writeln(outf,str[i]);
writeln(outf);
for i:=18 to 22 do
  writeln(outf,str[i]);
writeln(outf);
for i:=23 to 31 do
  writeln(outf,str[i]);
writeln(outf);
for i:=32 to 36 do
  writeln(outf,str[i]);
close(outf);
end;{pr2}
{------------------------------------------------------------------------}




{---------Матрица изохронных производных----------------------------------}
  For k:=1 to nk do
   begin
     if k < 4 then varc:=varc1 else varc:=varc2;

     for l:=1 to nk do
         xv[l]:=xu[l];
     xv[k]:=xv[k]+varc;

    {1}     WriteInfile(FileOut,xv);

    {2}      {Запуск интегратора--10обор-}
              {swapvectors; }
              exec('iszm_puc.exe','');
              {swapvectors;
             {---------------------------}

    {3}     ReadInFile(FileIn2,cm);
     for l:=1 to nm do
         Am[l,k]:=(cm[l]-xc[l])/varc;
   end;
{-------------------------------------------------------------------------}

